---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FabricationPartWidthOut
source: html/46aa7461-a3ba-1825-8aad-c07855b4046e.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FabricationPartWidthOut Property

"Main Secondary Width"

## Syntax (C#)
```csharp
public static ForgeTypeId FabricationPartWidthOut { get; }
```